IsElementVisibleInTemporaryViewMode Method
 Identifies if the input element is visible for the temporary view mode for this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsElementVisibleInTemporaryViewMode(
	TemporaryViewMode mode,
	ElementId id
)
Visual Basic
Public Function IsElementVisibleInTemporaryViewMode ( _
	mode As TemporaryViewMode, _
	id As ElementId _
) As Boolean
Visual C++
public:
bool IsElementVisibleInTemporaryViewMode(
	TemporaryViewMode mode,
	ElementId^ id
)
Parameters
mode
Type: Autodesk.Revit.DBTemporaryViewMode
 The temporary view mode. Only TemporaryHideIsolate and AnalyticalModel modes are supported by this option. Other modes will result in an exception.
id
Type: Autodesk.Revit.DBElementId
 The element id.
Return Value
 True if the element is visible, false if the element is hidden in the view mode.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  This view mode is not supported for checking element visibility.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
Autodesk.Revit.ExceptionsArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →